In [4]:
import pandas as pd
df=pd.DataFrame({"names":["Mounika","Bhulekhya","Shannu"],
                 "id":[282,920,847],
                 "marks":[50,60,70]
                })
print(df)

       names   id  marks
0    Mounika  282     50
1  Bhulekhya  920     60
2     Shannu  847     70

In [5]:
df.plot()

In [4]:
df.index=[15,27,38]
print(df)

        names   id  marks
15    Mounika  282     50
27  Bhulekhya  920     60
38     Shannu  847     70

In [5]:
df.columns

Index(['names', 'id', 'marks'], dtype='object')

In [6]:
df

        names   id  marks
15    Mounika  282     50
27  Bhulekhya  920     60
38     Shannu  847     70

In [8]:
df.index

Int64Index([15, 27, 38], dtype='int64')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 15 to 38
Data columns (total 3 columns):
names    3 non-null object
id       3 non-null int64
marks    3 non-null int64
dtypes: int64(2), object(1)
memory usage: 96.0+ bytes

In [10]:
df.describe()

               id  marks
count    3.000000    3.0
mean   683.000000   60.0
std    349.189061   10.0
min    282.000000   50.0
25%    564.500000   55.0
50%    847.000000   60.0
75%    883.500000   65.0
max    920.000000   70.0

In [11]:
df.size

9

In [12]:
df.shape

(3, 3)

In [14]:
df.dtypes

names    object
id        int64
marks     int64
dtype: object

In [20]:
df.dtypes.value_counts()

int64     2
object    1
dtype: int64

## Indexing, selection and slicing

In [22]:
df.loc[15:27]

        names   id  marks
15    Mounika  282     50
27  Bhulekhya  920     60

In [23]:
df.iloc[0:2]

        names   id  marks
15    Mounika  282     50
27  Bhulekhya  920     60

In [24]:
df.loc[38]

names    Shannu
id          847
marks        70
Name: 38, dtype: object

In [27]:
df.drop(columns=["marks"])

        names   id
15    Mounika  282
27  Bhulekhya  920
38     Shannu  847

In [28]:
df

        names   id  marks
15    Mounika  282     50
27  Bhulekhya  920     60
38     Shannu  847     70

In [30]:
df.drop([38])

        names   id  marks
15    Mounika  282     50
27  Bhulekhya  920     60

In [31]:
df

        names   id  marks
15    Mounika  282     50
27  Bhulekhya  920     60
38     Shannu  847     70

In [40]:
t=pd.Series([1001,2030,3526],name="phno")

In [41]:
df["phno"]=t

In [42]:
df

        names   id  marks  phno
15    Mounika  282     50   NaN
27  Bhulekhya  920     60   NaN
38     Shannu  847     70   NaN

In [43]:
t

0    1001
1    2030
2    3526
Name: phno, dtype: int64

In [44]:
df["phno"]=t

In [45]:
print(df)

        names   id  marks  phno
15    Mounika  282     50   NaN
27  Bhulekhya  920     60   NaN
38     Shannu  847     70   NaN

In [46]:
df["phno"]=2036

In [47]:
df

        names   id  marks  phno
15    Mounika  282     50  2036
27  Bhulekhya  920     60  2036
38     Shannu  847     70  2036

In [48]:
df.rename(columns={"phno":"mob"})

        names   id  marks   mob
15    Mounika  282     50  2036
27  Bhulekhya  920     60  2036
38     Shannu  847     70  2036

In [49]:
df.shape

(3, 4)

In [50]:
df.size

12

In [3]:
df["names"].describe(include="o")

count          3
unique         3
top       Shannu
freq           1
Name: names, dtype: object